///////////////////////////////////////////////////////////////////////////////
// usings
///////////////////////////////////////////////////////////////////////////////

using UnityEngine;
using System.Collections;
using System.Collections.Generic;

///////////////////////////////////////////////////////////////////////////////
// \class FSMBase 
// 
// \brief 
// 
///////////////////////////////////////////////////////////////////////////////

public abstract class FSMBase {

    ///////////////////////////////////////////////////////////////////////////////
    // non-serialized
    ///////////////////////////////////////////////////////////////////////////////

    [System.NonSerialized] public fsm.Machine stateMachine = null;

    // ------------------------------------------------------------------ 
    // Desc: 初始化状态机
    // ------------------------------------------------------------------ 
    public virtual void Init () {
        if ( stateMachine == null ) {
            stateMachine = new fsm.Machine();
        }
    }

    // ------------------------------------------------------------------ 
    // Desc: 开启状态机
    // ------------------------------------------------------------------ 
    public virtual void StartFSM () {
        if ( stateMachine != null ) {
            stateMachine.Start();
        }
    }

    // ------------------------------------------------------------------ 
    // Desc: 重启状态机
    // ------------------------------------------------------------------ 
    public void RestartFSM () {
        if ( stateMachine != null )
            stateMachine.Restart();
    }

    // ------------------------------------------------------------------ 
    // Desc: 停止状态机
    // ------------------------------------------------------------------ 
    public void StopFSM() {
        if (null != stateMachine) {
            stateMachine.Stop();
        } 
    }

    // ------------------------------------------------------------------ 
    // Desc: 每帧调用
    // ------------------------------------------------------------------ 
    public void deal () {
        if ( stateMachine != null )
            stateMachine.Tick();
    }

    public void discard()
    {
        stateMachine = null;

        //调用虚函数
        _onDiscard();
    }

    //释放资源函数
    protected abstract void _onDiscard();
}
